<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Политика конфиденциальности</title>
    <style>
        body {
            font-family: Arial, sans-serif;
            background-color: rgba(0, 0, 0, 0.8);
            margin: 0;
            display: flex;
            justify-content: center;
            align-items: center;
            height: 100vh;
            color: #000;
            overflow: hidden;
        }
        .modal-content {
            background-color: #fff;
            padding: 20px;
            border-radius: 8px;
            width: 90%;
            max-width: 600px;
            box-shadow: 0 4px 8px rgba(0, 0, 0, 0.2);
            position: relative;
            max-height: 90vh;
            overflow-y: auto;
        }
        .close-button {
            background: none;
            border: none;
            font-size: 24px;
            cursor: pointer;
            position: absolute;
            top: 10px;
            right: 10px;
        }
        h2 {
            margin-top: 0;
        }
        .policy-text {
            font-family: Arial, sans-serif;
            margin-top: 20px;
            white-space: pre-wrap;
        }
        .policy-text ul,
        .policy-text ol {
            margin-top: 10px;
            margin-bottom: 10px;
            padding-left: 20px;
        }
        @media (max-width: 600px) {
            .modal-content {
                width: 100%;
                border-radius: 0;
                height: 100vh;
                max-height: 100vh;
            }
        }
    </style>
</head>
<body>
    <div class="modal-content">
        <button class="close-button" onclick="window.close();">&times;</button>
        <h2>Политика конфиденциальности</h2>
        <div class="policy-text">
            <!-- Ваш текст политики конфиденциальности вставьте сюда -->
            <ol>
                <li>Введение<br><br>
Настоящая Политика конфиденциальности описывает, как наш мессенджер собирает, использует, защищает и раскрывает личную информацию пользователей. Мы стремимся обеспечить высокий уровень защиты персональных данных и соблюдать все применимые законы о защите данных.
                </li>
                <li>Сбор информации</li><br>
Мы собираем следующую информацию при регистрации пользователей:
                <ul>
                    <li>электронная почта.</li>
                </ul>
В процессе использования нашего мессенджера мы также обрабатываем:
                <ul>
                    <li>текстовые сообщения и emoji.</li>
                </ul>
                <li>Использование информации</li><br>
Мы используем собранную информацию для следующих целей:
                <ul>
                    <li>обеспечение работы нашего мессенджера и предоставление услуг пользователям.</li>
                    <li>управление учетными записями пользователей и обработка аутентификации.</li>
                    <li>отправка уведомлений по электронной почте (при необходимости).</li>
                </ul>
                <li>Защита информации</li><br>
Мы принимаем соответствующие технические и организационные меры для защиты персональных данных от несанкционированного доступа, изменения, раскрытия или уничтожения. К таким мерам относятся:
                <ul>
                    <li>шифрование текстовых сообщений и паролей.</li>
                    <li>контроль доступа к информации.</li>
                    <li>регулярные аудиты безопасности.</li>
                </ul>
                <li>Раскрытие информации</li><br>
Мы не раскрываем персональные данные пользователей третьим лицам, за исключением следующих случаев:
                <ul>
                    <li>при наличии согласия пользователя.</li>
                    <li>для выполнения наших юридических обязательств.</li>
                    <li>в целях защиты прав, собственности или безопасности нашей компании или других лиц.</li>
                </ul>
                <li>Права пользователей</li><br>
Пользователи имеют право:
                <ul>
                    <li>запрашивать доступ к своим персональным данным.</li>
                    <li>требовать исправления неточной или неполной информации.</li>
                    <li>запрашивать удаление своих данных при определенных условиях.</li>
                    <li>возражать против обработки своих данных.</li>
                </ul>
                <li>Контактная информация</li><br>
Если у вас есть вопросы или замечания по поводу данной Политики конфиденциальности, пожалуйста, свяжитесь с нами по следующему адресу электронной почты:
                <ul>
                    <li>sanmorow@gmail.com</li>
                </ul>
                <li>Обновления политики</li><br>
Мы оставляем за собой право вносить изменения в настоящую Политику конфиденциальности. Все изменения будут опубликованы на нашем веб-сайте. Мы рекомендуем регулярно просматривать данную страницу для получения актуальной информации о нашей Политике конфиденциальности.
            </ol>
        </div>
    </div>
</body>
</html>
<?php /**PATH D:\Work\Messenger\Project\example-app\resources\views/privacyPolicy.blade.php ENDPATH**/ ?>